{"Id":"136496","ProductId":"P1000-03","UserId":"#oc-R1OGEG6X7R7642","ProfileName":"The Truth","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":4,"Time":"1338854400","Summary":"Worth another try!  Update to previous reviews.","text":"Tried this coffee based pretty much on the assumed introductory price.  I was a little skeptical about trying this product based on the reviews, due to the explosion issues.  Reviewers didn't rave on the taste too much however.  So after receiving these cups, I gave one a whirl, and had no problems brewing it.  I did notice that the box that they were packaged in could use some (might I say) environmental saving upgrades, and the box itself was a bit rough shod.  Also I examined a few of the K-cups and there seems to be a vacuum issue with them.  Some looked as if they were ready to blow up right in my hand, as they were so full of air, or whatever it is inside them, they were like a balloon that when over blown with air, it could explode in your face at any second.  The others seemed like they had no air or nitrogen or what ever inside. Cups could be squished and squeezed and the foil top would just waffle back and forth.  So that seems to be another quality control issue, with the vacuum packing and sealing process. Perhaps that may lead to the product quality itself once made in the cup.  I really don't think I have had the same consistent taste with one of these cup yet.  My first cup was rather weak, as in it tasted like I had run twice as much water through it than I should have.  Really had a watered down taste.  The following few cups weren't much different.  I am using a controlled amount of water, but the consistency of the coffee that gets filtered into the cup seemed to be all over the place.  There have been a couple of cups that seemed to be almost \"just right\" but still on the weak side, given this is supposed to be a medium roast.  I mean, I've had medium blends that taste like French Roast, but this I would really have to classify as a very light roast.<br />Too light for me, so I'm sure if I re-order, I'll try a stronger blend.<br />That being said, I think these guys at Brooklyn Roasting Co. are on the right track, and I do hope they can find a way to keep the price down.  If so, and assuming I can find the right roast for me, I might stick with them for a while.  If the price goes up, where it's tooth to tooth with the big boys, I'm afraid the big boys will win me out.<br /><br />Update 8/15/12. Well, just when I thought this problem with exploding cups was solved...BOOOOM!!! Coffee grounds everywhere!  YES, It happened to me.  *I'm trying to insert a photo, if I can figure that out. I'm pretty confident though that this will be my last purchase of these Brooklyn k cups.  It's one thing to have a passion to go after a piece of the K cup Pie, but if you can't do it right, don't do it at all.  This company (based on several buyers and reviews, even before I happened on to these \"cheaper\" cups) had plenty of chances to get it right.<br />*Apparently Amazon or this company will not allow additional photos, as I tried to post an image of the exploded cup sitting in my machine.  My guess is they would have far too many photos of the dastardly messes.<br /><br />Update 9/03/12.  Ok, Based on the fact that this company is serious about hanging in there, and making things right with their customers, I am giving these guys another \"college try\".  After the exploding cup, they very graciously sent me replacement cups.  I did not ask that they be replaced, or demanded that they redeem themselves, I merely reported the problem, along with a photo, and next thing I knew, they were asking me for more info, about the product that I had, and then told me they would send some replacements. Again, I did not solicit these, but a few days later, a very generous offering was delivered to me.  I am really excited to try out all of the other flavors now, as the sent a sample box of several different flavors.  My wife and I have already tried a couple of the new flavors and so far they were quite good.  My wife really liked the Vanilla blend, and wants me to order a box of that alone.  I had the french roast, and thought it was pretty good as well.  The cups performed nicely and I'm looking forward to trying all of the others.<br />So I suppose that as I am always willing to give things another shot, I really think that this company is truly trying to deliver a great product, and is doing the right thing by taking care of it's customers, one cup at a time.<br />The only thing I'm still a little skeptical about is the pricing seems to be creeping up, closer to that of the big brothers in the business.  I was really hoping that they could keep them below .50 cents a cup, but are already surpassing that.  Pricing will be they main drive factor for me if these cups provide consistent and equally good or better coffee to that of the original players.<br />All that being said, I'm upgrading the star factor.  Thanks Brooklyn for taking care of me.  That was unexpected, but very welcome!"}