{"Id":"70233","ProductId":"P1000-05","UserId":"AO1Z0TQWCRGL4","ProfileName":"Harold Wolf \"Doc\"","HelpfulnessNumerator":1,"HelpfulnessDenominator":3,"Score":5,"Time":"1332374400","Summary":"fruit juice taste, diet friendly, healthy on-the-go drink","text":"I must watch my calories, sodium, sugar, and fat due to health issues. Thus tea is a preferred drink over sodas. I want to live, and live a good lifestyle. This product helps. Expecting good taste since it is produced by Lipton, a favorite of mine and my wife's, this was hardly a gamble in trying. The flavor was excellent, strong, fruity, and actually better than expected. I've tried lots of flavored teas and usually have gone back to regular plain old Lipton.<br /><br />Fat & Sodium are 0. Sugar only 1g per 8 oz. and calories only 5. 10mg caffeine if that's an issue for you, not for me. After realizing the drink was a bit sweeter, like southern sweetened tea, and I'm used to less sweet, I tried mixing the drink with an equal amount of club soda. WOW. Even better. Now the Lipton Blackberry Pomegranate flavor was still there, less sweet, the drink had the fizz of soda, calories cut to 2 ½, and sugar only 1/2g. The drink came out as clear as sun tea.<br /><br />Kids will love this sweetness. Kids need drinks with low calorie count. That's becoming major for child health.<br /><br />Convenience is a plus, an easily opened individual tube of powder, travel friendly, a freshly mixed drink at work, or make it one bottle at a time at home. No more having several types of bagged tea on the shelf to mix one with another, and then a remaining half-pitcher of tea going funky in the refrigerator. This has a shelf life of well over a year. It is tons better than instant teas I've tried, easier storage than bottled brew, and has the refreshing taste that the world has come to expect from Lipton. My sample convinced me to begin converting from the mess of tea bags.<br /><br />Dare I mention this can be carried in a shirt pocket or purse to a restaurant and instead of ordering those overpriced drinks, ask for the free iced water, then pour in your Lipton, stir, and \"Bob's your Uncle\"."}