{"Id":"136443","ProductId":"P1000-03","UserId":"AC2TBS8SACBS5","ProfileName":"Jenny \"Jen\"","HelpfulnessNumerator":8,"HelpfulnessDenominator":15,"Score":3,"Time":"1334707200","Summary":"Very cheap & No taste-*UPDATED REVIEW*","text":"Just received my first shipment and I must say this is awful. I am a heavy coffee drinker so I know coffee. This tastes just like the cheap stuff you buy at dollar tree in the bags. It is the least expensive kind of arabaca coffee that has no taste, not much odor and what it has is not that pleasant. I can definately see how they sell it so inexpensively. Please do not waste your money and getting stuck with the whole shipment. I have tried 3 cups and went from the regular setting all the way down to the least and it has barely gotten any stronger and the taste did not improve at all..<br />===================================================================================================================================<br />***THIS IS AN UPDATE TO THIS EARLIER REVIEW 4-27-12*** First let me say that this company and \"Ruth\" in customer service have been great people to deal with. Ruth has sent me a few cups of every flavor to try in hopes I would like one. I am a Coffee people Donut shop lover and the green mountain brews are also my faves and I am a heavy coffee drinker having tried every method and brew out there. I am in my late fifties so alot of coffees have passed these lips over the years. None of the brews are gourmet coffees and most of them I would not buy again. I do find the fuhgeddaboutit and the boardwalk blend the most appealing. These are in order the most comparable to donut. The other brews, Brooklyn Bridge, Breakfast Blend and Corner donut shop are drinkable but alot weaker and bland tasting with no aroma. I probably will not buy these in the future. The other brews I did not like at all. **TO the issue of Cups Exploding I only had one cup out of all I tried that left alot of grounds in my cup and that was the French Roast. (I never like french roast in any coffee anyway)I investigated as to why this happened taking the top foil off the cup rinsed out the grounds and discovered the problem. These kcups have a seperate inner filter which comes out, attached to a plastic ring. This filter is thinner and cheaper made than the regular keurig cups. Apparently when the water hit the grounds it blew a hole out in the side of the filter thus the grounds leaked out the bottom hole into my cup. This cup also had grounds stuck around the edge into the glue used to seal the cup thus it could not seal properly, even tho it appeared to seal OK. I suggest whoever this company is purchasing thier filter inserts from needs to use a thicker paper and that should solve the grounds problem. Then making sure the rim is cleaned of grounds will solve the sealing problem. As to lids being crooked Thier equipment just needs a little adjusting and that should be solved. These people have really tried and I give them top marks for thier efforts. No I dont work for the Co and don't know anyone there. I am in TN and they are in NY so there is NO connection. This is an honest heartfelt review from a regular consumer."}