{"Id":"136433","ProductId":"P1000-03","UserId":"#oc-R20T17BLTNKA3","ProfileName":"LFPV","HelpfulnessNumerator":2,"HelpfulnessDenominator":5,"Score":4,"Time":"1336089600","Summary":"Improved their product...Amazon & Brookly Bean Roastery fair to customers:)","text":"Below was my original review, but here is my updated review as of June 2012.  First off I'd like to say that I thought the company acted very quickly on their not so good reviews. I commend them for reaching out to their dissatisfied customers and giving consumers the opportunity to try their product again at no cost.  I was one of those consumers that Brooklyn Bean Roastery reached out to.  The first replacement order was better, but still not without problems similar to what I mentioned in my original review.  Weeks later I was offered another sample box and accepted.  This time around I have experienced no problems so far.  I do believe that this company acted responsibly in admitting there was a production problem and I must say that after two rounds of corrections, they seem to have the issue resolved.  As for the coffee itself, as I stated from the beginning, the taste is there, I have no complaints about the coffee itself. My favorites are the Breakfast Blend, the Columbian and the the Brooklyn Bridge Blend.  Hoping to see more light to medium blends in the future.  Thank you Brooklyn Bean Roastery for making me a proud Brooklyn girl once again:)<br /><br />P.S. I have since ordered more coffee from this company and I intend to continue as a regular customer.  The coffee is as good if not better than Keurig/Green Mountain's offerings for similar blends and the price is much better too. So if you're looking for a break on your wallet, try Brooklyn Bean Roastery's coffees, I don't think you'll be disappointed.<br /><br />***************************************************************************************************************************<br /><br />Original Review:<br /><br />I received my first two boxes of Brooklyn Bean Roastery Coffee for Keurig K-Cup Brewers back in April - one box of the Brooklyn Blend and another for the Columbian Blend. I was excited to try these coffees since I am originally from Brooklyn and lived half my life there - yes, a proud Brooklyn Girl. I could definitely relate to the some of the names used for their blends.  Well the excitement didn't last long.  I'm sorry to have to report that I can not recommend this coffee to anyone - whether from Brooklyn or not!  I have a Keurig machine which is well maintained always and was in perfect working order prior to using the Brooklyn Bean Roastery's version of the K-cups.  These cups have malfunctioned about 80% of the time regardless of which blend I used.  Grinds are all over including much of them in my half cup of coffee.  I have had to clean my machine countless times after trying to use these K-cups.<br /><br />I know by now you must be asking why would I continue to use them.  Well I contacted Amazon and explained the problems I was having and they offered to send me replacements.  I figured I would give them a try in hopes that they had isolated the problem cups and would be sending K-cups from a newer run of the product with the defect corrected.  Well that proved to not be the case.  Since a cup or two would actually work flawlessly now and then I was a bit determined to try and find what the problem was.  I knew it was not my coffee machine since all other brands (Green Mountain, Timothy's, Diedrich, etc) were all working without issue.<br /><br />Before I go any further, let me also say the coffee (when I managed to get a cup without grinds) was actually good.  On taste, I could recommend the coffee, but on performance and the chances of getting a cup without putting your expensive Keurig machine at risk - No, can't recommend.<br /><br />Lastly I would like to share what I found in trying to figure out the defect.  I noticed that the plastic cups are slightly thinner and more 'wimpy' than the other brands.  Next I noticed the exit hole made by machine was not as large as was made in the other brand cups.  I suspect this is because the plastic cup is too weak and collapses and therefore making it difficult for the coffee machine's exit needle to make a clean cut hole into the bottom of the plastic cup.  Without a proper exit hole I believe this changes the pressure in the cup as the machine is trying to brew.  What usually ends up happening is a lot of the grinds and water backs up and comes out the top hole in the cup - and sometimes causing the foil cover to explode.<br /><br />What I have done to try and salvage some of these cups is I put the cup in the machine as usual and allow the machine to pierce it's hole into the cup and then I remove the cup and gently widen the hole on the bottom with a sharp/pointed object, even a paper clip can do.  Just be careful that you do NOT go far up into the cup where you would be likely to puncture the paper filter.  Doing this I have reversed the rate of failure and am now getting 80% success.  Some cups still fail - those with off-centered foil covers or paper filters that are not attached.  Yes, I actually found unlike other brands, the paper filter is not always attached and can actually be moved around in a circular motion.  Most of these things are a matter of quality control I would imagine and as for the thinner plastic, that may be a matter of going too cheap on the product - just a thought.<br /><br />I hope this review has been helpful to some, especially those trying to get some use out of the product vs. throwing all that coffee/money down the drain.<br /><br />In closing, I do hope the company can correct these problems since as I stated, the coffee taste is fine - it's the product used to contain it that needs help!  In the meantime, Fuhgeddaboudit!"}