{"Id":"136416","ProductId":"P1000-03","UserId":"#oc-R2CIG5JYXHVPEE","ProfileName":"Scott R. Custer","HelpfulnessNumerator":81,"HelpfulnessDenominator":98,"Score":3,"Time":"1333756800","Summary":"Spectacular Brewing Failures but much less frequent (caffeinated only)","text":"Something about the Brooklyn Bridge compelled me to try this product and - admittedly - I jump all over the K Cup spectrum trying each variety. I should also note that I'm hardly a coffee expert; even gas station coffee that has been sitting for two hours tastes fine to me. The ONLY reason I'd ever write a coffee review is if something about the packaging made life difficult and this is certainly the case here.<br /><br />On our first brew in the Keurig, coffee grinds were thrown out of the top of the machine and all over the counter. When we removed the pod, the foil had actually been shifted off of the base, creating about a half of an inch slit for grinds to be pushed out by the force of the water during the brewing cycle. To be fair, we tried three more pods and each exploded in their own, creative ways. On one , the hole created in the top was massive and allowed grinds to explode out of the container (I assume weak foil allowed the hole to grow during brewing. On another, for whatever reason, only an eighth of a cup of coffee was allowed out of the pod.<br /><br />OK - maybe our brewer needed cleaning or was in a state of disrepair? We put a pod of known good Timothy's in and the machine performed flawlessly.<br /><br />I'm assuming that in this first run of product, this coffee either missed on the specification for packing for the Keurig, used some bad materials, or perhaps both. But I'd steer clear for a while. I just tried to send these back but Amazon doesn't take returns on Grocery products. I'll be calling shortly to see what can be done. As is, these are useless and a pure waste of money.<br /><br />===Updated April 19, 2012===<br /><br />As you can see, Ruth from Brooklyn Bean Roastery Coffee used this thread to offer to replace my bad lots of coffee of which I had two, the Brooklyn Bridge Blend and the Decaf blend. I took her up on the offer, wrote her, gave my address, and indicated that I would change my review if warranted based on the results. Although I got no response to my email, two boxes of coffee showed up about a week later. So we put them to the test.<br /><br />The first box that I opened was the Brooklyn Bridge Blend. I tried four of the pods, and each worked without issue. The coffee was tasty enough but the real measuring stick for me was 'are there coffee grounds on my counter' and the answer in this case was no.<br /><br />Alas, we tried the Decaf. The first two pods immediately blew up during brewing. In one case, grounds came out of the coffee machine and in the other, grounds filled the coffee cup. In this case, the coffee failed my rather simple test criteria.<br /><br />The unfortunate thing is this company knew they were replacing bad batches of pods, had all the advanced warning that they needed to select a batch of known good quality, and we encountered the same issues as on our first purchase.<br /><br />I'm very appreciative of this company's efforts to make this right but my sense is that they have immature quality control processes and I cannot recommend this brand based on the higher than acceptable probability that you will end up with a bad batch.<br /><br />===Edit May 3, 2012===<br /><br />Ruth at Brooklyn Bean sent me a sample pack which contained seven different caffeinated flavors for me to try. I very much appreciate the efforts of this company to show their quality control processes have been fixed. I am not quite done with the entire sample pack but I wanted to post my progress for those interested.<br /><br />First, though, to Lisa Lou and others who may be thinking it, I am confident that I have ruled out machine error as a factor in my previous reviews. First, the machine was fully cleaned and de-scaled before testing and I have numerous \"known good\" pods from other suppliers that function flawlessly.<br /><br />That being said, I can say that these samples have performed very well. I have tested the following:<br /><br />4 Donut Shop<br />2 Cyclone<br />4 Boardwalk Blend<br />4 French Roast<br />1 Breakfast Blend<br />1 Columbian<br />1 Fuhgeddaboutit<br /><br />Of these 17, only one time (with a Boardwalk Blend) did the pod explode in the manner described in my review. It did explode fabulously - with grinds coming onto the counter and filling the internal unit (very hard to clean) - requiring a full cleaning of the machine. This happened only once, however, and this rate of failure isn't out of line with what I've experienced with other brands (they just fail in different ways - like grinds in the cup or a half full cup of coffee).<br /><br />I can say with reasonable confidence that the production issues are probably solved for the *caffeinated* flavors. I have no way of determining if the issues associated with the decaf have been solved.<br /><br />I am switching my rating to 3 Star given the spectacular (but more rare) nature of failures with this brand and given the uncertainty of the performance of the decaf variety.<br /><br />I hope this helps."}