{"Id":"70340","ProductId":"P1000-05","UserId":"A2XNOB1T796Y6B","ProfileName":"ChibiNeko \"Sooo many books, so little time!\"","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":3,"Time":"1332892800","Summary":"Not bad, has a bit of a weird aftertaste, though","text":"There's only one thing keeping me from giving this a solid 4 star rating: the aftertaste, which I'll get more into later.<br /><br />First, the good. Other than the aftertaste, this tastes pretty good. I can pick out the different flavors of pomegranate, blackberry, honey, and tea, and they don't clash with each other. They're well blended together for the most part and this is pretty awesome with a lot of ice.<br /><br />It's just that the aftertaste ruins it. There's this slight chemical taste to the product that really interferes with the other flavors, making it so I am unable to forget that this is a powdered mix. It isn't something that would keep me from drinking the tea, but with how well everything else works together it's pretty noticeable. Again, this isn't something that I'd say would keep me from going out and purchasing it on my own, just something I hope that Lipton works on in the future.<br /><br />Aside from this, I only had one gripe that did not detract from the product itself and I didn't change the ratings for this at all. I'm just really irritated at the packaging saying that this is a 5 calorie beverage. It is, but only if you plan on using half of the packet. This is something that is standard for most companies and it's really irritating since the majority of consumers will use the entire packet and many will count the entire beverage as 5 calories when it's really 10. It's not as big of a deal here as it is with some of the more sugared products with higher calorie and carb counts, but this is sort of misleading unless you're someone who scours the nutritional and serving information on everything you buy.<br /><br />Overall though, this is something I'd probably go out and buy with my own money.<br /><br />3.4/5"}