{"Id":"110699","ProductId":"P1000-04","UserId":"AQ52JX9ES6XYY","ProfileName":"Chris S.","HelpfulnessNumerator":2,"HelpfulnessDenominator":2,"Score":5,"Time":"1303862400","Summary":"Heaven for decaf drinkers!","text":"If you already know about VIA, let me just say that this is the decaf version, and it's fabulous -- 'nuff said!  :)<br /><br />If you don't know about VIA, boy, are you in for a treat.  VIA is Starbucks' trademark name for their new version of instant coffee.  Before you give up in disgust, stop and think:  would they really blow their name by bringing out something undrinkable like ordinary instant?  No, they're not that stupid, right?  So... there must be something unlike ordinary instant going on here.  Bingo!  Here's how I discovered it:<br /><br />My coffee maker (a Cuisinart GRIND-n-BREW, less than 2 weeks beyond the warranty period, naturally) gave up the ghost just before a big dinner party, and my husband and I aren't eager to make big purchases these days, to put it mildly.  At Sam's Club I ran across a large-sized pack of single-serving little tubes of Columbian VIA and thought, hey, why not -- gives us some more time to decide on our new coffeemaker.  Sam's doesn't sell any decaf VIA, so I had to admit to being out of decaf at the dinner (most of our guests gave up at that point, not wanting to caffeinate themselves so late in the evening), but the few who still wanted coffee were served VIA without knowing it.  All 3 praised our coffee, and I personally thought it was terrific!!  I 'fessed up to everyone's surprise and gave them each a single-serving packet to take home.<br /><br />Since then, I've had nothing but VIA.  Not only do I enjoy it as much as brewed fresh-ground Starbucks coffee, but I absolutely love the convenience of \"brewing\" a single serving whenever I want it, instead of waiting for a whole pot, throwing some of it out after it lingered for an hour or two, and then waiting for a whole new pot later if I want more.  Needless to say, we haven't replaced the Cuisinart, and that was months ago.  (Note:  a single serving is 8 oz., and our porcelain coffee mugs hold 10 oz., so it works beautifully for us, whether a single cup or a dozen:  just put a tube's worth into each mug and add steaming hot water to what you've predetermined is the 8 oz. point).  I also love not having to wonder whether my big bag of whole beans is still fresh or whether to throw out the rest and plunk down serious cash on the next one:  the VIA is fresh each time, so I'm actually spending less per cup than I had been before.  Not to mention the serious pain previously of cleaning the grinding mechanism on the GRIND-n-BREW for every new pot... :(<br /><br />The only problem I originally had was no decaf, so I was giving up drinking any coffee at all after 3 or 4 in the afternoon.  Then, naturally, I found the decaf on Amazon -- HOORAY!!!  I'm about to order my sixth case of this wonderful decaf, which tastes as good as any decaf I've ever had.  The only other place I've ever found the decaf is on Starbucks' own website, and it's cheaper from Amazon, especially if you're a Prime member.  Amazon scores again, and then some.<br /><br />The best part?  How portable it is!!  If you end up agreeing with me that it's as good as \"brewed\", then just imagine being able to take one of these little tubes with you anywhere you go, just add it to 8 oz. of steaming hot water, and then end up with a fresh cup of fabulous-tasting coffee?  Ymmmm...  (Especially nice to have some in my bag for \"emergencies\", such as when a restaurant tells us at the end of a nice dinner out that they don't have any more decaf...)<br /><br />Try both the caffeinated and the decaf -- I'll bet you end up being incredibly glad you did, and I'll bet the two combined save you a lot of time, money and inconvenience.  Go for it!  :)"}