{"Id":"110619","ProductId":"P1000-04","UserId":"A1ZYTP6QQ1CGU4","ProfileName":"H. Jones","HelpfulnessNumerator":3,"HelpfulnessDenominator":3,"Score":4,"Time":"1344988800","Summary":"Pretty good for instant coffee","text":"I am a serious coffee drinker, I grid my beans just before I brew the coffee, and yes, I taste the difference between burr grinder and blade grinder. Oh, yeah, I am that serious. So you probably can imagine why I have been against instant coffee for years. Becasue they normally taste aweful! Sour and chemical taste, no fragrance at all. So, when a friend told me about VIA, I giggled, called her \"one of those\" and joked about how she used coffee to flavor her milk. (I applogize! I do i do). Until one day, another friend ask me to buy instant coffee for him. I laughted at him too. But no request from a friend is too much. I bought the smallest VIA package possible, and tasted it. To my surprise, it doesn't have that sour taste, and the chemical taste was very low and can be ignored, especially if you drink your coffee with sugar (which I strongly against).<br /><br />I like the skinny long bag. when I was choosing between scissors and teeth to open the bag, the bag was teared open so easily from the top with just my fingers. Of course, that alerted me to hide it away from my toddlers. Next thing I did was no brainer, I dumped the powder into a coffee mug, and poured the hot water in it. I doubted if I really needed to stir it, but I did it anyway. The smell was not as strong as my fresh burr grinded cofee, but good enough to believe that it was coffee. I confess, I almost helded my breath when I had my first sip, ready for all sorts of aweful taste. But to my surprise, the taste was not sour at all. I had no trouble drinking the whole cup down and licked my lips and thinking \"hmm, not bad\". the second thought was \"I am only hot water away from another cup\".<br /><br />Now, here comes to final judgement:<br />For instant coffee, this is awesome! No grinder, no loud noise. You can carry it with you anywhere you go. no scissors needed. a good cup of coffee is just some hot water away. But, can it replace the old fashioned fresh grinded coffee? No, No No. Still not there yet. But I am keeping them around th house now for the time when the house needs to be dead quiet and I was craving for a cup of coffee.<br /><br />4 star because it is still not as good as fresh grinded coffee."}