{"Id":"83564","ProductId":"P1000-01","UserId":"A2UBV1LR7SA4C4","ProfileName":"SpringFever \"Bud\"","HelpfulnessNumerator":3,"HelpfulnessDenominator":3,"Score":5,"Time":"1341964800","Summary":"Fantastic Product and a BIG Surprise","text":"I am very surprised that the biggest secret about San Francisco Bay single service coffee , which works perfectly in famous brand K-Cup makers, has not been revealed in any of the previous comments.  Or at least I did not find the secret yet revealed.  I love Amazon.com and am a high volume customer but folks, you can get this product at COSTCO at a significant savings.  An 80 count box at COSTCO is just around $30; unit cost is about 34 cents.  Do not hesitate because of the 80 count box.  The contents are packed 8 units to a heavy duty sealed nitrogen filled bag that will hold for over a year.  You will find the 'good until' date clearly printed on each bag.  When you cut open the bag (you will need scissors) the phenomenal fragrance of freshly ground French Roast coffee comes right at you.  If you like that rich smell of fresh ground, this will be almost as good as when you drink it after brewing.<br /><br />So is this a good coffee?  I am an old restaurant guy and I always prefer my coffee rich, dark and not bitter.  I tried virtually all the K-cup samplers available so I could do a comparison of the DARKS, BOLDS and FRENCH ROASTS I could find.  Other than a few Sumatra brews, this SF BAY product stood out at the top of the list.  That even includes the really expensive stuff that is good but not good enough to be price competitive or flavor superior. If you do not at least try this coffee in your K-Cup brewer, you are missing a unique opportunity for quality and value.  If you shop at COSTCO, you need to look for it and get the best competitive single serve French Roast around town.  You will also find that San Francisco Bay bulk coffees have been sold at COSTCO for a very long time.<br /><br />Now, about that little filter material container in place of the plastic cup you are used to seeing.  Well, the Rodgers Family who produce all the San Francisco Bay Coffees (and other labels), are independent and want us all to get their premium coffees without having to pay the Royalties to use the \"K-Cup\" brand name...and they do not want to infringe on copyright designs, so they were inspired to have this design created.  The entire container portion of the unit is indeed a filter and allows for the best extraction methodology.<br /><br />You must be asking yourself if I am a \"shill\" for this company and the answer is an emphatic NO.  I am just a life long student of consumer economics and I really like to give credit when and where it is earned.  The Rodgers family business is located in Lincoln, California in the vicinity of where I live - and I also like to support my local business.<br /><br />You may forget all about what I have said here, but you will always remember San Francisco Bay French Roast once you have tasted it."}