{"Id":"70133","ProductId":"P1000-05","UserId":"ARSQ2F9U315WG","ProfileName":"Biblioholic Beth","HelpfulnessNumerator":1,"HelpfulnessDenominator":2,"Score":4,"Time":"1332115200","Summary":"Delicious flavor, contains sucralose","text":"I was curious to try this, as the \"Honey\" part caught my eye. I have tried the previous edition that had the aspartame, and it had a strange aftertaste that I wasn't fond of. I like to have little packets like this to keep in my purse or in the car though, and the flavor sounded pretty good.<br /><br />As soon as it arrived, I read the box. I wanted to see what the ingredient list was. And so I must say, if you're looking for something with no artificial sweetener at all - BEWARE. This does not have aspartame, but it DOES have sucralose (otherwise known as SPLENDA). I was a bit disappointed when I read that, as I was hoping it was just honey as the sweetener.<br /><br />However, I went ahead and made some - I even measured out the 16.9oz so that my initial taste-test could be as accurate as possible. I smelled the packet when I first opened and could definitely smell the mango. The pineapple was less pronounced. Then I the water in a glass container with a lid (I wanted to see how well it dissolved). One good shake and I could still see some bits (probably the honey) floating around. Two more really good shakes and other than a small bit in the bottom, it was all dissolved. I opened the lid of the container and took another smell - again, very strong mango, with a bit of pineapple. It smelled really good. As for the taste - it lives up to the smell. I really like it. I don't get any aftertaste from the sucralose, and the fruit flavors are not too strong. It's not overly sweet, though that is individual taste and can be easily fixed by adding a bit more water.<br /><br />Overall, despite my disappointment with the addition of sucralose (which is why I gave it 4 stars vs. 5), I would happily buy this. It tastes delicious, can be adjusted for taste, dissolves easily, and is convenient to carry around."}