{"Id":"83569","ProductId":"P1000-01","UserId":"A2DI7UGT3YX4Q9","ProfileName":"NyiNya \"NyiNya\"","HelpfulnessNumerator":7,"HelpfulnessDenominator":9,"Score":5,"Time":"1333497600","Summary":"A step in the right perfection","text":"5:45 a.m. The alarm just went off. You want to be on the road before 7. You find the kitchen, get out the kettle and start the water boiling. Get out the Boodum, fill it up. Wait. Water boils. Pour it in the press. Wait.  Wait more. Can't wait any longer. Push plunger, drink, coffee is weak, pillow starts calling your name, you lose the will to shower, next thing you know, it's 8:15 and you're praying for the grid to melt down.<br /><br />OR, you get up at 5:45 a.m., drop a K-Cup in your Keurig, push a button and your cup runneth over (especially if you accidentally pushed the button with the picture of the mug on it).  And if it's San Francisco Bay Fog Cutter, you also get a deliciously rich, full-bodied, fragrant brew that is acid free and gentle on an early morning tummy.  Best of all, you can drink your Fog Cutter while waiting for the stuff in the Boodum Coffee Press to be ready. Now you can face the shower, the hair dryer, the curling iron and the eyelash curler without fear.<br /><br />I prefer the Boodum to the Keurig, but when you need coffee now, this blend can't be beat.  It's the best of all the K-Cup offerings that I've tried, and I've tried everything from Donut Shop to Newman's Own and most points in between.  It is my early morning wake up favorite.<br /><br />I was very amused, not to say impressed, by one reviewers comments about the packaging  He notes that there is a drawing of a K-Cup type machine on the front of the box and a list of various K-Cup brewers that will accommodate this version of the K-Cup.  He points out that the San Francisco Bay Coffee supports many environmental projects, as noted on the top of the box, which also shows photos of these worthy projects.  The Rodgers Family, who own the company, are shown in a family photo on one side flap, along with an essay on the company's values.  The other flap has a description of the actual coffee.  This guy is a whiz in the a.m.  I'm happy if I find the sink on the first try.<br /><br />Anyway, this is the best pre-coffee coffee I've ever had. And it's an excellent main course coffee too.<br /><br />Enjoy."}