{"Id":"70315","ProductId":"P1000-05","UserId":"A2QNJNCMAL0GZX","ProfileName":"E. Bennett \"II2None59\"","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":2,"Time":"1343520000","Summary":"Thumbs Down on Taste; Thumbs Up For Convenience","text":"This pertains ONLY to the Lipton To Go Stix (<a href=\"http://www.amazon.com/gp/product/B007P5NVBI\">Lipton To Go Stix Iced Green Tea Mix, Tea and Honey, Mango Pineapple, 10-Count (Pack of 4)</a>) product with the honey, mango and pineapple flavor. I had thought this would be a product I'd enjoy as mango and pineapple are two of my favorites when it comse to fresh fruit or smoothies; I've also been a Lipton tea customer for years, and have never been disappointed in their products. I even enjoy honey on occasion as a more natural sweetener, and was curious to see how these flavors would combine.<br /><br />This one was such a disappointment that I gave away what was left in my sampler box (my friends and family didn't care for it either). Now I liked the convenience of the stix, and have appreciated what companies have done in order to give you a somewhat cheaper form of \"flavored water\" so I thought Lipton might have had something.<br /><br />The honey was so prominent and overly sweet that it pretty much wrecked the remaining flavors; it also had a slight chemical tinge which left me with a horrible after-taste in the end. What there was of the mango and pineapple was not the fresh taste I had hoped for, but something with a disgusting artificiality that did not play up a combination which does work very well under most circumstances (such as when I've made up my own mixture); again there was way more artificial sweetness (and this is coming from a Southern girl who loves sweet iced tea on occasion). Even the fragrance was sickening and overpowering. The color in a 16.9 ounce bottle of water was a straw-yellow -- not quite golden, not quite regular yellow, but I figured that meant it would be strong enough to give me the full flavor I desired without being too weak. As I mentioned, I could only take several sips; I think I drank 1/3 of a bottle in the end...and then I called it quits. I even refrigerated it for a bit, as if hoping everything needed time to \"merge\"; after a few hours I tried again -- lost cause and down the drain it went.<br /><br />I don't know if the other flavors are an improvement, but I will never waste money to find out. Had the box I received NOT have been a sampler courtesy of Lipton, I would have demanded a refund. Back to the drawing board Lipton!"}