{"Id":"136428","ProductId":"P1000-03","UserId":"#oc-R3JZ6TGV9JTPFQ","ProfileName":"L. Matthews","HelpfulnessNumerator":4,"HelpfulnessDenominator":8,"Score":4,"Time":"1335312000","Summary":"I Wish I Could, I Wish I Might .....UPDATE 07/10/12","text":"07/10/12 Update<br />****************************************************************************************************************************************************<br />Okay, I was really disappointed with my first delivery from this company as you can read.  They contacted me about giving them another chance and I agreed. I have to say I was impressed with both the level of customer service and speed of delivery.  *5 STARS*<br /><br />Coffee Impression<br />Instead of a second batch of Colombian coffee I received a box of Brooklyn Bridge Blend.<br />First off kudos for fixing the lid problems! I had absolutely no explosions! Yea!!!<br /><br />Now the taste of the product sent.<br />My mother loves it as it's not strong. I was thrilled it was much stronger than the previous one and I received the correct amount of liquid for the setting.  The taste reminds me of my moms Nantucket blend coffee. Not bad but not really strong either. Not my personal preference in coffee.<br />As I stated, mom loved it so I am thrilled to pieces and will be ordering her a box!<br /><br />A thank you Brooklyn Bean Roastery for fixing the problems with the cups. This will now be a wonderful cheaper version to buy without a loss in quality.<br />****************************************************************************************************************************************************<br />I wish I could say something better about this coffee. I wish I might be able to give this Colombian coffee review something less than a zero. I wish I had my money back.<br /><br />Background:<br />I buy Wolfgang Puck, Donut Shop, Starbucks, & Variety packs, a lot.  I drink three or more cups every day! I also have two cups of tea, so my machine is something I know and understand. I have only had one previous bad experience with a k-cup and it was promptly taken care of, no problems since.<br /><br />Experience:<br />My first cup I pulled from the box was not sealed all the way so I had coffee grounds all in the box. I pulled out a second one inspected it, wiped the outside off and set to brew a 10oz cup. I heard hissing and thought \"Oh, God!\" but thankfully it hadn't burst, whew! It only filled the cup to about 8oz, it looked like the same amount as when I drink certain teas. The taste was so weak for such a small amount it was a bit like lightly flavored, colored water. Not good.  So, later I tried again but set it at 6oz like I would for my Chamomille tea. It exploded coffee grounds were everywhere! In my cup, machine and counter! No, I was not happy cleaning this crap up. That was it for me, three strikes or k-cups and i'm out I have no intention of every buying this company again!<br /><br />Conclusion:<br />I hope Amazon decides to protect it's customers and stop selling this coffee."}