{"Id":"136489","ProductId":"P1000-03","UserId":"#oc-R2Z2P7V8UEXH2","ProfileName":"J. Phillips","HelpfulnessNumerator":6,"HelpfulnessDenominator":8,"Score":5,"Time":"1339113600","Summary":"Your taste buds will thank you!","text":"I was pleased to win a sampler box of Brooklyn Bean Roastery's eight most popular varieties (2 of each) in a contest promotion, and I can't say enough wonderful things about this ambitious new company's offerings.  From what I read here in early reviews, they got off to a shaky start with quality control in the manufacturing of the K-cups, but rest assured that I experienced no problems whatsoever.  The quality of the coffee is top notch, and the blend variety is mesmerizing.  It's SO good, in fact, that it's really hard to pick favorites, which is why I think that the most brilliant thing Brooklyn Bean could do, is offer a VARIETY PACK!  After all, not every one wants the same exact coffee, cup after cup.  Variety is what makes life interesting, does it not?<br /><br />Brooklyn Bridge Blend was the first one I tried, and my personal favorite.  It's a delightful medium roast that delights any time of day or evening, with just the right balance of body and flavor.  If I had to choose one coffee to drink for the rest of my life, THIS would be the one.<br /><br />Breakfast Blend paled in comparison, being a light roasted coffee, and initially not a standout for me.  But, my wife thought it was stellar, and could easily be a daily, easy-drinking morning favorite, even though she usually prefers darker, stronger roasts.<br /><br />Their Colombian is by far the BEST Colombian I have ever had, very complex in taste with sweet and nutty undertones.  Start your day with this, and you'll have a happy day.<br /><br />French Roast is usually not high on my list, but Brooklyn's is astounding!  It doesn't display the bitterness that I usually find with other French Roasts, and makes an excellent dark roast after dinner coffee.<br /><br />Boardwalk Blend is a medium roast, extra bold, that is best made in a larger size cup, 10 or 12 oz, and is also excellent over ice!  It won't knock you out, because it's not overwhelming in any one character, but it's a pleasant, drinkable blend.<br /><br />Corner Donut Shop is unique, in that it's not like any other company's \"donut shop\" blends for the Keurig type machines.  The flavor is a bit more subtle, and compliments pastries, pies, donuts (of course) any time of day.  This is a relaxing coffee, not one to shake you up, which is a good thing sometimes.  Think of it as the \"comfort food\" of coffees.  Medium roast, extra bold, make this in a larger size cup, also.<br /><br />Cyclone, named for the iconic Coney Island roller coaster, is a kick in the pants coffee.  Strong, bold, daring and a thrill-ride of complex, intense flavors, circling your palette, with each sip being a new thrill ride.  Yes, you'll want to ride again!  My wife has called this the \"Guinness of coffees\", with chocolaty undertones and full-bodied texture.  Definitely make this in a larger cup, being both a dark roast and an extra bold cup.<br /><br />A Brooklyn uniqueness, Fuhgeddaboudit, is another dark roast extra bold blend that leaves no doubt in your mind that you're drinking a cup of COFFEE!  This will wake you up out of a coma, folks!  Only in New York could they possibly come up with something this brash, cosmopolitan and interesting.<br /><br />I rarely drink decaf, but would like to try BB's, and feel the same about flavored coffees, like their Maple, Hazelnut and Vanilla offerings.  But, in short, we're so fond of Brooklyn Bean coffees, all of them so far, that it really is a tough choice to shop for a 36 count box of any one blend.  This is why it would be astounding, if they offered for sale, variety packs!  Keep up the great work, Brooklyn, I predict that this will soon be the #1 K-cup coffee on the planet!"}