{"Id":"136417","ProductId":"P1000-03","UserId":"A3UX102ON2922M","ProfileName":"Vincent Trigili \"vydor\"","HelpfulnessNumerator":16,"HelpfulnessDenominator":19,"Score":4,"Time":"1336089600","Summary":"Cheap, but decent","text":"I order these K-Cups with the sole purpose of reducing my per cup cost. Understand I drink $60+ of coffee every month so I really need to cut back that cost. I purchased Cyclone and Fuhgeddaboudit as I am a fan of dark roasts in the Keurig. Cyclone's description stated it was the same as Dark Magic, which is my favorite K-Cup of all time. This gave em very high hopes for it. With Amazon subscribe and save it worked out to around 42 cents a cup, which is 15-20% cheaper then I pay for K-Cups normally.<br /><br />So that I can end on a positive note, let me start with the key problem I have had with these K-Cups. They seem to brew faster then the \"normal\" ones which yields a weaker flavor. I have not timed them, so that is more of a \"seems\" like then a hard number. They are weaker, and there is no good reason for that to be other then brewing to fast. You can use the manual pulsed brew with the Keurig to get around that, but that kind of goes against the convenience factor of the Keurig system.<br /><br />I measured 12g of coffee in them, which is excellent! More grinds are better, and many K-Cups only have 8-9g in them which is way to little for this format. Also I have had NO failures or issues brewing them so far. Every K-Cup has brewed with out any failings. I have heard that some have had issues with these k-cups getting grinds in their coffee, but I have not yet experienced that. My machine is a B-60 and has been rock solid since day one, and no K-Cup has given it a problem.<br /><br />Over all these are decent K-Cups, just weak when compared to the brews they claim to match. They are much much better then San Francisco Bay Coffee OneCup which I am not likely to ever by again. Plus the fact that these K-Cups have real coffee in them places them light-years ahead of the Grove Square (which is instant coffee in a K-Cup).<br /><br />Among the competition these take second to the GM K-Cups, but are way ahead of the rest of the field."}