{"Id":"70134","ProductId":"P1000-05","UserId":"A70NFM6KHU24F","ProfileName":"Trevor Burnham","HelpfulnessNumerator":4,"HelpfulnessDenominator":7,"Score":1,"Time":"1337299200","Summary":"Don't be fooled","text":"There's a stark disconnect between the front of the product's packaging (which promises \"Iced Green Tea\" with honey and natural fruit flavors) and the actual product. Lipton could conceivably have marketed convenient packets of gunpowder green tea, with its characteristic bitterness subtly curbed by tiny amounts of honey and fruit oils. Such a product might have been a hit with the health-obsessed, ingredient-conscious crowd that already enjoys unsweetened tea. Instead, they decided to go for a more mainstream audience: people who crave sweet-as-soda beverages, but want to feel good about what they're drinking.<br /><br />The result is a product that's almost indistinguishable from <a href=\"http://www.amazon.com/gp/product/B001EQ5DHE\">Sugar Free Kool-Aid</a>, but will likely be brought to market at a much higher price point based on its supposed healthfulness. The Lipton Stix packaging brags that (unlike Kool-Aid) it's got \"no aspartame\"--because it uses the artificial sweetener sucralose (aka Splenda) instead. Yes, green tea powder is the third ingredient (after honey granules and citric acid)--but to give you an idea of how much tea there is in this \"tea mix,\" a chart on the side brags about Lipton Stix containing 60mg of flavonoids per serving, comparing favorably to cranberry juice and orange juice. This is an extremely selective comparison. Most pertinently, a cup of tea typically contains anywhere from 200mg to 1000mg of flavonoids, depending on the variety, density, and brewing process.<br /><br />Now, it's one thing to emphasize a product's naturalness (\"natural flavors,\" \"made with real ingredients,\" \"tea & honey,\" \"real fruit flavors\") without mentioning the artificial sweetener anywhere other than the ingredient list. But there's one claim that I believe to be overtly deceptive: \"sweetened with honey.\" Let's examine that. Honey is listed in the ingredients as \"Honey granules (sugar, honey),\" which means that there's actually at least as much sugar as honey in the product. A half-packet serving has ~1g of sugars, so even under the generous assumption that there's as much honey as pure sugar, there's only about half a gram of honey per serving. Is it conceivable that you could detect half a gram of honey in 8oz of water? Certainly not if you add enough sucralose to make that 8oz of water taste as sweet as fruit juice (~25g of sugars).<br /><br />So to summarize: At best, honey accounts for 1/50th of the sweetness in Lipton Stix that the sucralose provides. Shame on you, Lipton."}