{"Id":"70308","ProductId":"P1000-05","UserId":"AF03NDXR2PIFX","ProfileName":"B. Wilson","HelpfulnessNumerator":4,"HelpfulnessDenominator":5,"Score":2,"Time":"1332288000","Summary":"It's not as natural as Lipton advertises","text":"I think that this Liptons To Go Green Tea Mix tastes OK, but I prefer real tea. My wife likes this Lipton's Decaf Iced Green Tea Mix. She likes the mild strawberry flavor.<br /><br />But it is not as natural as Lipton advertises. Lipton's product info states, \"Lipton Tea & Honey ... is a low calorie iced tea mix you can feel good about simply because it's made with real ingredients ... blended with honey and strawberry and acai flavors ... Sweetened with honey, made from real tea leaves and real fruit flavors ... flavor with other natural flavor ... and no aspartame.\"<br /><br />So what's there to not like about that? Well it's not all real ingredients and sweetened with just honey. The fine print discloses that it includes Sucralose (sweetener). Shane Ellison calls himself \"The People's Chemist\" and is the author of <a href=\"http://www.amazon.com/gp/product/1402225059\">Over the Counter Natural Cures: Take Charge of Your Health in 30 Days with 10 Lifesaving Supplements for under $10</a>. Shane was a big pharma chemist who quit when he discovered that the drugs that he was creating for the big pharma companies were nothing more than toxins and the real cures were natural and didn't require a prescription. Shane says that artificial sweeteners like Sucralose (Splenda) have serious problems. Studies show that they lead to weight gain and even pre-diabetes. Artificial sweeteners \"disrupt the body's natural calorie counter\" and \"put the users at much higher risk for being obese and insulin resistant.\" Shane says that Sucralose, 1,6-Dichloro-1,6-dideoxy-'-D-fructofuranosyl-4-chloro-4-deoxy-'-D-galactopyranoside, contains a historically deadly, nasty form of chlorine (RNFOC), which yields poisons such as insecticides, pesticides, and herbicides. \"An RNFOC can invade every nook and cranny of the body ... and may result in weakened immune function, irregular heartbeat, agitation, shortness of breath, skin rashes, headaches, liver and kidney damage, birth defects, and cancer. Hiding its origin, sucralose pushers assert that it is 'made from sugar'. Sucralose is as close to sugar as glass cleaner is to purified water. France recently banned such false advertising statements. The deceit has been ignored within the United States.\"<br /><br />Why does the FDA allow this? Shane says science was sold out for profit. \"Just like chemists manipulate the properties of matter, Big Pharma manipulates studies using 'checkbook science.' This allows them to pay for the design and interpretation of clinical trials. Checkbook science isn't illegal by FDA standards. It's been going on for over 20 years. Known as the Bayh-Dole Act, US law was amended in 1980 to permit flagrant conflicts of interest, ones that allow the industry to design drug trials and hire experts to conjure up favorable results at will.\"<br /><br />So if you want something natural, look for Shane Ellison's book and skip this Lipton's tea mix."}