{"Id":"136518","ProductId":"P1000-03","UserId":"#oc-R3LBXC8M092D8N","ProfileName":"rampageous_cuss","HelpfulnessNumerator":2,"HelpfulnessDenominator":3,"Score":4,"Time":"1338854400","Summary":"No Exploding Pods","text":"To be honest, I ordered this because of the price, but I have to say we haven't had any really bad experiences.  We've gone through two 36 packs at this point, and once or twice there's been some grounds in the brew - a slightly better record than Gloria Jeans'.  No sign of off-popping lids or anything like that.<br /><br />Flavor-wise it's a good medium roast that doesn't taste watery on the high setting.  I think it's better than anything of Gloria Jeans, and compares favorably to those 'morning blend' sorts of things you get from Green Mountain or Newman's Own.  I just wish they offered a hazelnut blend.<br /><br />Update July 30 -<br /><br />At this point I should probably raise my rating to five (or even six) stars - you just can't beat the quality of these K-cups at the current price point, which is incredible.  If Brooklyn Bean DOES bring in a hazelnut blend I'll HAVE to go up a star - though my tastebuds still yearn for the IMHO now wildly overpriced Van Houtten blends...<br /><br />Anyway, we've now tried the Corner Donut Shop, Boardwalk Blend, and Colombian K-cups with nary an exploding pod.  Irritatingly my wife preferred the Boardwalk blend, which is now discontinued, but the other two have been just as good as their Green Mountain, Newman's, or Timothy's equivalent, and are a much better brew than those San Francisco Bay pods which are weak on the high setting.  I've tried A LOT of the different brands out there - some are pretty good, but at this time you can't beat Brooklyn's price/quality ratio.<br /><br />Update August 25 -<br /><br />I sometimes have to revise my reviews, so here we go: I still like this stuff and will continue my subscriptions - but we HAVE had a couple problems.  I DO mean a couple - we have had two pods bleed grounds heavily, and one sort of jammed somehow - hot water backed up in the pod, only a half-cup poured through, and when I took out the pod I was almost scalded.  However we've gone through half-a-dozen boxes of Boardwalk, Donut Shop, and Colombian, so I'd say the odds are pretty good.  There's still no sign of any \"exploding pods.\""}