{"Id":"136484","ProductId":"P1000-03","UserId":"AR8NQVTCWM9QP","ProfileName":"Miss Betsey Trotwood \"Only bad witches are ugly\"","HelpfulnessNumerator":3,"HelpfulnessDenominator":11,"Score":1,"Time":"1335225600","Summary":"Updated: Why These F-Cups Will Never Work Correctly","text":"I'm no lawyer (Or am I?) but I'm pretty sure BBR can't call these \"K-Cups.\" This is a suggestion to Ruth at BBR - you need to change what you call these in your responses - you can't say, \"After all, we're filling these K-Cups with BBR Coffee.\"<br /><br />I'm not an engineer (Really, I'm not) but I can tell you that making something look like a K-Cup and not engineering it to work like a K-Cup is a recipe for disaster. My initial thoughts were the adhesive wasn't viscous enough, but it's wayyy more than that. The plastic is not thick or rigid enough to be punctured and rooted at the bottom of the K-Cup basket. Instead, the plastic just bends and re-forms in the basket - one of the reasons the coffee grounds are exploding UPWARD. You'll need a thicker, less bendable material.<br /><br />The foil cap isn't durable enough either, though if you replace the plastic with one that's stiffer, the foil may work. The adhesive should be upgraded to a material that can be heated, cooled, heated, cooled and never lose its qualities. You may of tested these in your office, but imagine materials that have to withstand sitting in the back of a UPS truck in Phoenix for 5 days. And after that must work in the pressure of a K-Cup basket just like a K-Cup. And you need to make sure that before sealing, you have a clean surface. Otherwise, no adhesive will work, and the adhesive is the weakest link among these materials. You do realize that steamy coffee grounds exploding can burn your customers, right? You can probably get an engineering student to intern for free to advise you, or hire an engineer. Thus ends my free advice.<br /><br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~initial review below~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br /><br />My 36-count box of Fuhgeddaboudit just arrived. I opened it up, wanting to brew one in the Keurig post haste. Unfortunately, after reaching in the box, my hand came out with coffee grounds all over it, and a K-Cup that looked like it never should have passed even the least rigorous quality control standards.<br /><br />C'mon, BBR! I want to LOVE your product! The coffee is delicious! I don't know who is responsible for quality control standards and testing, but these K-Cups are sub-par. Even a newb like me can see that the adhesive you're using is just not viscous enough. Surrounding every round label atop the K-Cup is a nice beard of coffee grounds.<br /><br />I like to think I'm not hard to please. I just want a product that doesn't force me to have to sweep or vacuum after taking it out of the box or removing one from the K-Cup carousel. That's the main reason I got a Keurig......I detest errant coffee grounds!<br /><br />What a disappointment - here I was looking forward to never having to send Green Mountain/Keurig another dime for K-Cups."}