{"Id":"83700","ProductId":"P1000-01","UserId":"A1GRFKOIAYG1C6","ProfileName":"John Morrison \"Curmudgeon\"","HelpfulnessNumerator":2,"HelpfulnessDenominator":2,"Score":5,"Time":"1330646400","Summary":"Not your average K-cup, but worth a taste","text":"I have my concerns about this coffee's packaging, but the important part first: It tastes good. Fog Chaser is a little more robust than I like for a morning blend (I tend toward a Dunkin Donuts style coffee first thing in the AM), but is perfect for afternoon or evening. The nonstandard pods fit into my B70 and while there has been occasional sediment, it's not been a problem with the majority of my 36-pod pack; at least, not as bad as (say) Grove Square. Yes, I'd buy these again.<br /><br />Now the negatives. As has been stated, the pods aren't plastic cups with embedded filters, sealed by a foil cover, but rather filter pouches with a plastic ring and foil cover. There's no need to punch a drain hole in the plastic cup, since there isn't one. I've heard concerns about the Keurig success causing more spent K-cups to be dumped in trash tips and landfills; I'd also guess that the construction makes it a non-trivial recycling task. So a redesign with less plastic would seem like a good thing.<br /><br />However, one of the charms of Keurig is that the cup is packed in a relatively inert gas: I've heard nitrogen, which would make sense. Oxygen is the enemy of coffee. Old coffee goes stale because it oxidizes. Keeping air away from coffee keeps it fresh... but the coffee in the San Francisco Bay Coffee company's packaging hasn't this feature. The bags (containing twelve pods each) are heavy-duty plastic with a metal button of unknown purpose, and perhaps those bags are filled with something other than oxygen... but as soon as you take them out, the coffee begins to deteriorate.<br /><br />Not that this happens in a matter of seconds, or even days. After all, keeping the lid on a pound can of coffee (I can actually remember when a pound was sixteen ounces, not 13.5) kept the coffee fresh enough, assuming you were a regular drinker. If you use a ziploc bag to store the unused pods from an opened bag, I'm sure that they'll stay fresh enough in the week or two that the bag lasts.<br /><br />My concern, though, is for occasional coffee drinkers, for whom the Keurig system is a godsend. For example, I dated a woman who hated coffee, but wanted me to have some when I visited. Having fresh coffee in an inert storage container would have been great. These, though, might go bad in between my visits to her house.<br /><br />So in conclusion, go ahead and buy these if you're a frequent coffee drinker who will finish a whole 12-pod bag in less than a month. Keep a couple of ziploc bags (sandwich bags hold 6) for storage. Companies that go through a whole lot of K-cups ought really to like these, especially since they're about 10% under the cost of most K-cups."}