{"Id":"70317","ProductId":"P1000-05","UserId":"A2DDVD6SPKZOZK","ProfileName":"Calamity Jane","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":4,"Time":"1342310400","Summary":"my teens loved it; I thought it a bit weird","text":"My teenagers love green tea and anything with a funky flavor, so I got them the mango pineapple flavor of this Lipton To Go green tea mix. It's a great way to flavor plain water, which one of my boys hates to drink.<br /><br />They both liked it quite a bit and said it tastes just like the pre-made Lipton green tea bottles you buy in the store. I mixed up half a packet in an 8-ounce glass of water for myself, and it took some time for it to fully dissolve. The color is a bit weird...a yellowy orange. I could taste the mango and the pineapple, but with the honey, it had a bit too much going on for me, flavor-wise. Didn't seem that balanced. I wouldn't make it again for myself, but I'd buy it again for my boys. Flavor is such a personal thing, though, and there are SO many reviews on here with different opinions, so if you're an adventurous sort, try it for yourself. It didn't have a chemical taste to me, just a lot of flavors going on.<br /><br />In reading the other reviews, I don't understand why some people are FREAKING out about there being Splenda in it. So?? Many low-calorie drinks are sweetened with Splenda (sucralose) or Nutrasweet (aspartame), and Splenda is a much better alternative than Nutrasweet. If you don't like artificial sweeteners, then don't get this product! And read the label first...yes, it says there's no aspartame, which may lead people to believe there are NO artificial sweeteners, but a quick glance at the nutrition panel tells you it has sucralose. Those of us who are hypoglycemic appreciate having products with lower sugar available to us, because we have to give up most sweets. If you prefer things with Stevia, then buy unsweetened tea mixes and flavor them yourselves. Toss in a little pineapple juice and honey and knock yourself out. But just because this tea has Splenda doesn't make it a product worthy of scorn. To each his own!"}