{"Id":"136444","ProductId":"P1000-03","UserId":"#oc-R1791MZMDMM68R","ProfileName":"D. Hines","HelpfulnessNumerator":9,"HelpfulnessDenominator":17,"Score":1,"Time":"1335052800","Summary":"All these bad reviews aren't kidding, folks - quality control on these is terrible","text":"I love a good strong cup of coffee - my favorite K-Cup is the Green Mountain Double Black Diamond Extra Bold, but I'll try any of the extra bold varieties and enjoy most of them.  So the \"Fuhgeddabboudit\" flavor intrigued me and I pre-ordered a box of 36 cups.  Took about a month to arrive, and I just tried it this morning.<br /><br />First off, the people talking about these things making messes on the counter aren't kidding.  The very first cup leaked all over the place, and gave me a cup full of grounds.  I was almost reluctant to try another one - something like that can't be very good for your Keurig machine - but gave it a shot.<br /><br />It wasn't bad, but it didn't measure up to the Double Black Diamond, and since it's essentially the same price, why shouldn't I get the stuff I really like instead?  I found the flavor a little thin, lacking the richness of a DBD cup.  It was okay, but nothing to write home about.<br /><br />The real trouble is, I'm reluctant to play K-Cup Roulette with these, given that lots of people are apparently having this same issue.  I believe I'm going to contact Amazon about returning these - I'm not willing to risk screwing up my $150 Keurig with poorly-made defective K-Cups.<br /><br />The people at Brooklyn Bean Roastery need to pay a little more attention to quality control.  There's really no excuse for this sort of rampant shoddiness in their products.<br /><br />UPDATE: Amazon refunded my money without even wanting me to return the K-Cups.  Once again Amazon's superb customer service takes care of a problem and makes a customer happy.  If only all businesses were so easy to deal with and focused on doing whatever it takes to satisfy their customers."}