{"Id":"70112","ProductId":"P1000-05","UserId":"A3G5MOHY1U635N","ProfileName":"APF \"SPB-RU\"","HelpfulnessNumerator":17,"HelpfulnessDenominator":21,"Score":2,"Time":"1333411200","Summary":"Could be OK if not for the artificial sweetener and flavors","text":"The product's name lead me to believe it would be naturally flavored with flavors I like.  Unfortunately, the flavor of the artificial sweetener is very pronounced and it is a flavor I strongly dislike.  I do not use artificial sweeteners and avoid artificially sweetened beverages because I do not like the flavor, not for health reasons.<br /><br />I used one packet per 24 oz bottle of water and I am sure that if I were to mix it per instructions it would be way too sweet.  I was not able to taste honey or pomegranate.  Blackberry is somewhat pronounced, although not as a natural but as an artificial blackberry flavor.<br /><br />I also had a problem with packaging.  When I tore the corner of a packet at notch, the resulting hole was too small for the contents to pour out.  I had to jiggle the packet and push the contents out.  That created a cloud of fine dust which I inhaled - not pleasant.  I struggled with the second packet as well.  It is possible that it is just the batch I received that did not have the tear notch punched properly.<br /><br />The description says \"Sweetened with honey, made from real tea leaves and real fruit flavors.\" I am surprised this kind of marketing is allowed or tolerated.  It is just as much (probably more if you consider contribution to the total sweetness) sweetened with artificial sweeteners as it is with honey.  As for the green tea or pomegranate flavor...  Who can tell that this tastes anything like either one of those things?  It seems like a manufacturer can show to a cousin of a random employee a picture of tea leaves and pomegranates and let them listen to bees buzzing and then claim that the product was made with tea leaves, honey, and real pomegranate flavor.<br /><br />I would not buy this product the way it currently is."}