{"Id":"70346","ProductId":"P1000-05","UserId":"A30Z0GG96D11EO","ProfileName":"Sofia Hernandez \"Shut up B*&#$!\"","HelpfulnessNumerator":3,"HelpfulnessDenominator":4,"Score":3,"Time":"1334620800","Summary":"Kool-Aid for adults!","text":"Blackberry Pomegranate has never let me down before when it comes to flavored drinks.  When I saw this offering and it claimed to be natural I became very interested.  From a packaging stand point, I love the way these little packets can be thrown in a glove compartment, purse, diaper bag or book bag.  They travel well and open easily.<br /><br />Upon opening the packet I would pour the powder into a standard water bottle (16.9 fl oz.) and shake very very vigorously.  I found that if the water was not ice cold and I did not continue to shake vigorously for a minute then there would be flavor crystal sediment on the bottom.  If the water was ice cold, the powder would incorporate well.  The color does stain, so that may be a concern for some.  Now for the flavor aspect...  Personally this Iced Green Tea mix is just too sweet and artificial flavored.  From the first sip I was assaulted by a cloyingly sweet and rather sickening flavor.  I resorted to sort of holding my breath and guzzling down.  When it came to the last quarter of the bottle I would always dump it; just too sweet.  For me, it tasted very much like what I remember red Kool-Aid tasting like when I was young.  I personally don't allow my children to drink red Kool-Aid.  They loved this stuff!  A bit too enthusiastically for my liking.  They would fight over the bottle, which was just plain odd.  Two days passed and when I returned to the cabinet I had discovered that the kids has been sneaking the packets and polished off the whole box.  My husband on the other hand, hated it and he loves sweet drinks.  He didn't like the sweet 'fake' aftertaste (his words).<br /><br />If you like very very sweet tasting drinks and prefer when drinks have that fake 'aspartame' taste then this should be a winner for you.  Our kids aged 9, 8 and 5.5 loved it.  They found it easy enough to mix on their own apparently.  I just wish that the product was a bit more natural and less 'diet'.<br /><br />Recommend only if you fit the the profile of a customer that would enjoy it.  If you love Kool-Aid mixed with way too many portions then you might just enjoy this.  Kudos on the packaging, which is very much like Crystal Light... thumbs down on a very kiddie oriented flavor profile.  Blackberry pomegranate sounds very adult... Kool-Aid not so much."}