{"Id":"83675","ProductId":"P1000-01","UserId":"A22GBKSAD45EE3","ProfileName":"Holly E. Barkan \"Holly B.\"","HelpfulnessNumerator":2,"HelpfulnessDenominator":2,"Score":3,"Time":"1343606400","Summary":"Not the best, not the worst.","text":"I recently ordered this because I was excited about the reduced plastic in the packaging. Interestingly, the day I ordered it my husband came home with the same brand from the grocery store, so I've now tried 2 different flavors. I would give both the same review. The coffee is okay. It's not horrendous, as some people seem to imply, and its not amazing either. The smell is good and smells like nice fresh coffee when you open the box. The flavor is nice enough too. I also love super strong coffee. I drink Revv, Jet Fuel, Wake Up Call, etc. I would not say that this coffee rivals them, but it is stronger than some other medium roast coffees.<br /><br />Big reasons why I wouldn't give this 5 stars:<br /><br />1) The coffee gets very watered down when brewed on a larger cup size. I usually do the 10 oz size and this coffee just doesn't cut it for that. I feel it becomes more like coffee flavored water at that point. 8 oz is better, but its ideal at 6 oz. So, now I just save it for when I want a small cup.<br /><br />2) There is a strange film that brews with the coffee. You can see it floating on top and it sticks to the sides of the mug when you tilt it, so there is like a ring of residue that gets left around the edge where the coffee moved away. You can also see it as darker specks floating on top after you add creamer. I don't know what this is. I have no other coffee that does this. It doesn't really change the taste or texture or anything, but I just don't like it.<br /><br />I think the packaging is a big plus though. I am not sure why the cups being open is such an issue for people. I just put all mine in a zip lock bag (that I can just keep reusing) to keep it air tight. It's really not that difficult. Plus I think it's important to cut down on plastic waste.<br /><br />So all in all, I do plan to buy this coffee again. I like that I can reduce waste and I like it enough that its good for a midday refresher since it has to be a small cup. We are also on a tight budget so that helps as well. However, I don't see myself replacing all my coffee with it, because I want a much larger and stronger cup of coffee in the morning and brewing two of these eliminates both the value and the positive aspects of less waste."}