{"Id":"136412","ProductId":"P1000-03","UserId":"A28HFAVRIWL7JH","ProfileName":"James Woodruff","HelpfulnessNumerator":6,"HelpfulnessDenominator":11,"Score":5,"Time":"1333843200","Summary":"Brooklyn Bean Roastery Coffee, Single Serve Cup for Keurig K-Cup Brewers, 36-Count","text":"<a href=\"http://www.amazon.com/gp/product/B006Q822L0\">Brooklyn Bean Roastery Coffee, Fuhgeddaboudit, Single Serve Cup for Keurig K-Cup Brewers, 36-Count</a><br /><br />Product arrived yesterday, by USPS Priority Mail, how cool is that, delivered on Saturday. Was surprised to find the product in K-styled cup format. I excepted it to be like San Francisco Bay Coffee Decaf OneCup for Keurig K-Cup Brewers, French Roast, unique format, because of the much lower price. Gave it a try, liked it.<br /><br />But, Huston, we have a problem here. Say again, copy, its Brooklyn. There is a quality control issue at the packaging facility. Second cup, such a mess. The foil seal separated, or wasn't glued properly. Liquid goes everywhere, coffee grounds were coffee grounds just shouldn't be, including the in the cup of fresh brew. Now, to be fair, this happened not long ago with an Emeril's K-cup from Green Mountain Coffee and they never replied to my customer service e-mail complaint. The mess, isn't fun to clean up, trust me.<br /><br />Taking the K-styled cup apart, I find another unique design change, the filter snaps in, not glued. This will be great for refilling. But wait, there's more, in the case of this rogue K styled cup,  the filter wasn't snapped down on its seat as the first cup was. Need to fixed this NOW, or this product will go to the land of never to be heard of again, real fast. (Why K-styled cup; Green Mountain Coffee has informed, threaten, via their mighty corporate legal team, servearl providers of K styled cup refill alternitives, that GREEN MOUNTAIN COFFEE OWNS THE LETTER \"K\" CONCERNING ALL THINGS K-CUP)<br /><br />Hope this issue is resolved soon, like the coffee, like the Subscribe and Save price. And no,I don't live in Brooklyn.<br /><br />Ok, lets try cup number three, three's the charm, rignt?<br /><br />FLASH-UPDATE<br /><br />Brooklyn Customer Servvice came through, is trust worthy,and cares about their customers. Not only did they send replacement product, they sent a whole new box, not just a few cups, or sample box, but all 36 cups. How great is that!<br /><br />Thanks Brooklyn, love the coffee and it make outstanding ICED coffee."}