{"Id":"83662","ProductId":"P1000-01","UserId":"#oc-R2ZARZZGRIU309","ProfileName":"NoLimit24_FJ \"J Nolan\"","HelpfulnessNumerator":1,"HelpfulnessDenominator":4,"Score":1,"Time":"1349395200","Summary":"Chasing the Fog and Forgetting the Bug!","text":"I have been drinking coffee for over 40 plus years now.  Folks, I have tried so many varieties from Instant to Drip to K cups, and the list goes on.  Hopefully, the reader gets the picture...I love my coffee.  Yet, I am not sure what this \"stuff\" is.  Here is my experience...<br /><br />First, I get the shipment.  Open it up, and I must admit, I do like the nice box the coffee arrives in.  I do appreciate the added note on the box from the Robinson Family along with their mission statement.<br /><br />\"Taste the Difference - Make a Difference - Community Aid Program\" and there is more information on the side of the box which really sort of made me \"feel good\" about my purchase.  The Robinson Family goes on to state \"Offering the best value to you, our customer.  Treating our employees, suppliers, and customers as if they were part of our family.\"  I mean all this really made me feel good and I was glad I had purchased a product where a \"family\" supported others...<br /><br />Yet, that is where it ended.  I opened the box, cut open the plastic sealed containers this \"cups\" come in, and grabbed my first little strange looking but new looking \"k cup\".  Please note, as others have said, these are completely different than an actual \"k cup\", but I thought unique and liked the design....<br /><br />UNTIL...yes, UNTIL...I hate to write this, but the very first thing I noted on the side of this \"bag cup\" was something that looked like a bug!!  It politely dropped in the palm of my hand, and since it was not \"wiggling\", I figured I could examine it very closely.  I did....<br /><br />YUCK!  It was some sort of freaking small, slim BUG!!  I thought maybe it was my ole' eyes, but had my son examine it and he confirmed my verdict....<br /><br />Did I go ahead and try the coffee???  Well, again, I hate to admit this, but I figured the bug could not \"kill\" me, so yes...I went ahead and tried the other \"cup\" things (honestly, I don't know what to call these little cups\").  My first reaction was just \"disgust\"...The flavor was weak and the cream and sugar simply diluted to the bottom of the cup.  Nothing like the Rev K Cups or other K cups I had used...<br /><br />So, I went to the computer to write a review...no, not today I thought...I wanted to be fair, because, again, I felt a part of the \"Family\" the manufacturer had written about on the box...and maybe the \"bug\" was still in my mind!<br /><br />Thus, here I sit today several days later, and just finished another of these cups....and after using a few of the things...I just honestly cannot understand why all the high positives written by other reviewers?  Honestly?  I am trying to like these things due to the price and the \"Family\" caring thing...but, this coffee is simply too weak and does not taste like \"coffee\" to me.  In comparison, it sort of reminds me of an off the wall instant coffee on the weak scale...<br /><br />Folks, all of you who have written such positive reviews...trust me, I want to be open minded...I want to like this coffee.  I tried smaller cups on my K cup machine, and it simply gets worse...<br /><br />So, in conclusion, maybe I got a \"bad box\"?  I mean should there have been a \"bug\" in it to begin with??  Even with that...get past the bug issue...where is the flavor?  Why does the cream and sugar simply dissolve to the bottom of the cup leaving a bad looking residue as you get to the last sip?  It dissolves \"into the coffee\" with other brands...<br /><br />I love the price, and wish I could like this...is there another type other than the \"Fog Chaser\"???  Would like to stay with the Robinson Family, but not left in the \"Fog\" as this is sort of how I feel trying to drink this coffee .....\"Fog Chaser\"????  Well, I am definitely \"chasing the Fog\"...trying to understand how this is called \"coffee\"????<br /><br />I will continue through this box the best I can, and \"if\" I find one of the cups different, then in all fairness, I will update this review to treat the \"Robinson Family\" fair...And yes, I guess maybe I am crazy to drink through all these things since the bug was on the first one, but I figure the hot water should kill any harmful bacteria...hope I am right??  But, again, I want to emphasize, it is not the \"bug\" that is causing my dislike of this \"wattery, weak...very odd coffee\"....."}